import re  # Імпортує модуль для роботи з регулярними виразами

# Функція для валідації електронної адреси
def validate_email(email):
    # Перевіряє, чи відповідає вказаний електронний лист шаблону
    return bool(re.match(r'^[\w\.-]+@[\w\.-]+\.\w+$', email))
    # Повертає True, якщо електронна адреса відповідає шаблону, інакше False

# Функція для валідації номера телефону
def validate_phone(phone):
    # Перевіряє, чи відповідає телефонний номер українському формату (+380 та 9 цифр)
    return bool(re.match(r'^\+380\d{9}$', phone))
    # Повертає True, якщо номер телефону відповідає шаблону, інакше False
